// Определить порядок выполнения операторов с помощью таблицы приоритетов операций.

1.
var x = 6, y = 15, z = 4;
console.log(y /= x + 5 % z); //2.142857142857143
// '/=' - 3; '+' - 13; '%' - 14; 
// 1. 5/4 = 1.25;
// 2. 6 + 1.25;
// 3. 15 / 7.25

2.
var x = 6, y = 15, z = 4;
console.log(z = x++ + y * 5); // 81
// '..++' - 17; '+' - 13; '*' - 14;
// 1. x++ = 6;
// 2. 15 * 5 = 75
// 3. 6 + 75 

3.
var x = 6, y = 15, z = 4;
console.log(x += y - x++ * z); // -3
// 1. 6 * 4
// 2. 15-24
// 3. -9 + 6

4.
var x = 6, y = 15, z = 4;
console.log(z = --x - y * 5); // -70
// 1. --x = 5;
// 2. 15 * 5;
// 3. 5 - 75

5.
var a = 3;
var b = ++a + 1 + a++;
console.log(b); // 9
// 4 + 4 + 1
